class TipItem {
  final int id;
  final String tag;
  final String title;
  final String imagePath;
  final String? content;

  const TipItem({
    required this.id,
    required this.tag,
    required this.title,
    required this.imagePath,
    this.content = "",
  });
}

const List<TipItem> kTips = [
      TipItem(
        id: 1,
        tag: "Nutrition tips",
        title: "บริโภคโปรตีนผงแทนมื้ออาหารปกติได้ไหม?",
        imagePath: "assets/tip1.png",
        content: "       โปรตีนผงสามารถใช้แทนมื้ออาหารบางมื้อได้ โดยเฉพาะในช่วงที่ต้องการความสะดวกหรือหลังออกกำลังกาย แต่ไม่ควรแทนทุกมื้อ   เพราะโปรตีนผงมักขาดสารอาหารจำเป็น เช่น ไฟเบอร์ วิตามิน และไขมันดี ควรเสริมด้วยอาหารจริงที่มีผัก ผลไม้ และธัญพืชเพื่อให้ร่างกายได้รับสารอาหารครบถ้วน",
      ),
      TipItem(
        id: 2,
        tag: "Nutrition tips",
        title: "วิธีบริโภคโปรตีนจากพืชเพื่อลดน้ำหนัก",
        imagePath: "assets/tip2.png",
        content: "       การเลือกโปรตีนจากพืช เช่น เต้าหู้ ถั่วเลนทิล ควินัว หรือถั่วชนิดต่าง ๆ ช่วยเพิ่มความอิ่มนานและให้ไฟเบอร์สูง ซึ่งช่วยควบคุมความอยากอาหารและลดพลังงานสะสมได้ดี การจับคู่โปรตีนพืชกับผักและธัญพืชไม่ขัดสี จะช่วยเพิ่มคุณภาพของกรดอะมิโนให้ใกล้เคียงโปรตีนจากสัตว์มากขึ้น",
      ),
      TipItem(
        id: 3,
        tag: "Nutrition tips",
        title: "การใช้สายตาคำนวณปริมาณโปรตีนให้เข้าใจ",
        imagePath: "assets/tip3.png",
        content: "       หากไม่มีเครื่องชั่ง สามารถใช้การกะด้วยสายตาได้ง่าย ๆ โดยใช้ “ฝ่ามือ” เป็นตัววัด ขนาดโปรตีนเท่าฝ่ามือ (เช่น อกไก่หรือปลา) จะให้โปรตีนประมาณ 20–30 กรัม วิธีนี้ช่วยให้วางแผนโภชนาการในชีวิตประจำวันได้สะดวกและแม่นยำในระดับหนึ่ง",
      ),
      TipItem(
        id: 4,
        tag: "Nutrition tips",
        title: "โปรตีนที่จำเป็นต่อร่างกายมีปริมาณเท่าไหร่?",
        imagePath: "assets/tip4.png",
        content: "       ปริมาณโปรตีนที่ควรได้รับขึ้นอยู่กับน้ำหนัก และกิจกรรม โดยทั่วไปอยู่ที่ 1.2–2.0 กรัมต่อน้ำหนักตัว 1 กิโลกรัม เช่น น้ำหนัก 60 กก. ควรได้รับ 72–120 กรัมต่อวัน หากออกกำลังกายหรือเล่นเวทเทรนนิ่ง อาจต้องการใกล้ 2.0 กรัม เพื่อช่วยซ่อมแซมและเสริมสร้างกล้ามเนื้อ",
      ),
      TipItem(
        id: 5,
        tag: "Nutrition tips",
        title: "บริโภคโปรตีนรวมไปในคราวเดียวได้หรือไม่?",
        imagePath: "assets/tip5.png",
        content: "       แม้ร่างกายจะสามารถรับโปรตีนครั้งละมาก ๆ ได้ แต่การดูดซึมและนำไปใช้มีประสิทธิภาพสูงสุดเมื่อบริโภคครั้งละ 20–40 กรัม ควรกระจายโปรตีนให้สม่ำเสมอทั้งวัน เช่น เช้า กลางวัน เย็น เพื่อให้ร่างกายมีกรดอะมิโนพร้อมใช้ตลอดเวลาในการซ่อมแซมและเสริมสร้างเนื้อเยื่อ",
      ),
      TipItem(
        id: 6,
        tag: "Workout tips",
        title: "การยืดกล้ามเนื้อบริเวณปลายแขน",
        imagePath: "assets/tip6.png",
        content: "       เวลาใช้แขนจับของหรือเล่นดัมบ์เบลนาน ๆ ปลายแขนจะตึง ควรเหยียดแขนตรงไปข้างหน้า ใช้อีกมือดึงฝ่ามือเข้าหาตัว ค้างไว้สัก 20–30 วินาที ทั้งหงายและคว่ำมือ จะช่วยให้ข้อมือแข็งแรง ลดอาการปวดเมื่อย",
      ),
      TipItem(
        id: 7,
        tag: "Workout tips",
        title: "การนวดแก้เจ็บหัวไหล่จากท่า Shoulder Press",
        imagePath: "assets/tip7.png",
        content: "       ถ้าเล่นท่ายกน้ำหนักเหนือหัวแล้วไหล่ตึงหรือเจ็บ ใช้นิ้วหรือลูกบอลเล็ก ๆ กดเบา ๆ ที่กล้ามเนื้อรอบหัวไหล่ หมุนเป็นวงกลม จะช่วยให้กล้ามเนื้อคลาย แต่เลี่ยงการกด ตรงข้อต่อโดยตรง และควรทำเบา ๆ หลังยืดกล้ามเนื้อ ",
      ),
      TipItem(
        id: 8,
        tag: "Workout tips",
        title: "ท่านอนยก Dumbbellกับร่างกายเรา",
        imagePath: "assets/tip8.png",
        content: "       เวลานอนยกดัมบ์เบล (Bench Press / Fly) จะได้กล้ามเนื้อหน้าอกเป็นหลัก แขนและหัวไหล่ช่วยออกแรง ด้วย ท่าที่ถูกต้องคือ หลังแนบกับม้านั่ง เท้าวางมั่นคง ข้อศอกไม่กางกว้างเกินไป จะช่วยให้ปลอดภัยและออกแรง ได้เต็มที่",
      ),
      TipItem(
        id: 9,
        tag: "Workout tips",
        title: "การปรับท่าออกกำลังกายให้เหมาะกับแต่ละคน",
        imagePath: "assets/tip9.png",
        content: "       หุ่นแต่ละคนไม่เหมือนกัน บางคนแขนยาว ขาสั้น หรือหลังไม่ยืดพอ ดังนั้นท่าออกกำลังกายควรปรับให้เข้า กับตัวเอง เช่น Squat บางคนต้องกางขากว้างขึ้น หรือ Bench Press อาจต้องลดมุมศอก การปรับแบบนี้ช่วยลด เจ็บและทำให้เล่นได้ถูกจุดมากกว่า ",
      ),
      TipItem(
        id: 10,
        tag: "Workout tips",
        title: "อาการหมอนรองกระดูกกับเส้นประสาท",
        imagePath: "assets/tip10.png",
        content: "       อาการคือปวดหลังแล้วร้าวลงขา รู้สึกชา หรือขา อ่อนแรงสาเหตุจากหมอนรองกระดูกกดทับเส้นประสาท หากยังออกกำลังกายหนักหรือยกของผิดท่า อาการอาจ แย่ลง ควรเลี่ยงท่าที่กดหลังเยอะ ๆ และเน้นฝึกกล้ามเนื้อ แกนกลาง รวมถึงปรึกษาแพทย์หากมีอาการต่อเนื่อง",
      ),
];
